Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2064DAS169.atdf
         <register caption="System Bus Target 'x' Error Log Register 1" name="SBT16ELOG1" offset="0x34400" rw="R" size="4">
            <bitfield caption="Transaction Command of the Requester bits" mask="0x00000007" name="CMD" values="SBT16ELOG1__CMD" />
            <bitfield caption="Requested Region Number bits" mask="0x000000F0" name="REGION" values="SBT16ELOG1__REGION" />
            <bitfield caption="Initiator ID of Requester bits" mask="0x0000FF00" name="INITID" values="SBT16ELOG1__INITID" />
            <bitfield caption="Error Code bits" mask="0x0F000000" name="CODE" values="SBT16ELOG1__CODE" />
            <bitfield caption="Multiple Permission Violations Status bit" mask="0x80000000" name="MULTI" values="SBT16ELOG1__MULTI" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT0ELOG2" offset="0x4" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT0ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT1ELOG2" offset="0x404" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT1ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT2ELOG2" offset="0x804" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT2ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT3ELOG2" offset="0xc04" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT3ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT4ELOG2" offset="0x1004" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT4ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT5ELOG2" offset="0x1404" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT5ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT6ELOG2" offset="0x1804" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT6ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT7ELOG2" offset="0x10404" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT7ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT8ELOG2" offset="0x10804" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT8ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT9ELOG2" offset="0x10c04" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT9ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT10ELOG2" offset="0x11004" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT10ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT11ELOG2" offset="0x11404" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT11ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT12ELOG2" offset="0x11804" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT12ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT13ELOG2" offset="0x20404" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT13ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT14ELOG2" offset="0x20804" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT14ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT15ELOG2" offset="0x20c04" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT15ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Log Register 2" name="SBT16ELOG2" offset="0x34404" rw="R" size="4">
            <bitfield caption="Requested Permissions Group bits" mask="0x00000003" name="GROUP" values="SBT16ELOG2__GROUP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT0ECON" offset="0x8" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT0ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT1ECON" offset="0x408" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT1ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT2ECON" offset="0x808" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT2ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT3ECON" offset="0xc08" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT3ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT4ECON" offset="0x1008" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT4ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT5ECON" offset="0x1408" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT5ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT6ECON" offset="0x1808" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT6ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT7ECON" offset="0x10408" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT7ECON__ERRP" />
         </register>
         <register caption="System Bus Target 'x' Error Control Register" name="SBT8ECON" offset="0x10808" rw="RW" size="4">
            <bitfield caption="Error Control bit" mask="0x01000000" name="ERRP" values="SBT8ECON__ERRP" />
         </register>
