Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ2064DAS169.atdf
      <value-group caption="Endpoint 7 Transmit Interrupt Enable bits" name="USBCSR1__EP7TXIE">
         <value caption="Endpoint Transmit interrupt events are enabled" name="" value="0x1" />
         <value caption="Endpoint Transmit interrupt events are not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 1 Receive Interrupt Enable bit" name="USBCSR2__EP1RXIE">
         <value caption="Receive interrupt is enabled for this endpoint" name="" value="0x1" />
         <value caption="Receive interrupt is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 2 Receive Interrupt Enable bit" name="USBCSR2__EP2RXIE">
         <value caption="Receive interrupt is enabled for this endpoint" name="" value="0x1" />
         <value caption="Receive interrupt is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 3 Receive Interrupt Enable bit" name="USBCSR2__EP3RXIE">
         <value caption="Receive interrupt is enabled for this endpoint" name="" value="0x1" />
         <value caption="Receive interrupt is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 4 Receive Interrupt Enable bit" name="USBCSR2__EP4RXIE">
         <value caption="Receive interrupt is enabled for this endpoint" name="" value="0x1" />
         <value caption="Receive interrupt is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 5 Receive Interrupt Enable bit" name="USBCSR2__EP5RXIE">
         <value caption="Receive interrupt is enabled for this endpoint" name="" value="0x1" />
         <value caption="Receive interrupt is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 6 Receive Interrupt Enable bit" name="USBCSR2__EP6RXIE">
         <value caption="Receive interrupt is enabled for this endpoint" name="" value="0x1" />
         <value caption="Receive interrupt is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint 7 Receive Interrupt Enable bit" name="USBCSR2__EP7RXIE">
         <value caption="Receive interrupt is enabled for this endpoint" name="" value="0x1" />
         <value caption="Receive interrupt is not enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Suspend Interrupt bit" name="USBCSR2__SUSPIF">
         <value caption="Suspend signaling is detected on the bus (Device mode)" name="" value="0x1" />
         <value caption="No suspend signaling detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Resume Interrupt bit" name="USBCSR2__RESUMEIF">
         <value caption="Resume signaling is detected on the bus while USB module is in Suspend mode" name="" value="0x1" />
         <value caption="No Resume signaling detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Reset/Babble Interrupt bit" name="USBCSR2__RESETIF">
         <value caption="(In Host mode): indicates babble is detected / (In Device mode): indicates reset signaling is detected on the bus." name="" value="0x1" />
         <value caption="No reset/babble detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Start of Frame Interrupt bit" name="USBCSR2__SOFIF">
         <value caption="A new frame has started" name="" value="0x1" />
         <value caption="No start of frame detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Device Connection Interrupt bit" name="USBCSR2__CONNIF">
         <value caption="In Host mode" name="" value="0x1" />
         <value caption="No device connection detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Device Disconnect Interrupt bit" name="USBCSR2__DISCONIF">
         <value caption="In Host mode" name="" value="0x1" />
         <value caption="No device disconnect detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Session Request Interrupt bit" name="USBCSR2__SESSRQIF">
         <value caption="Session request signaling has been detected" name="" value="0x1" />
         <value caption="No session request detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Vbus Error Interrupt bit" name="USBCSR2__VBUSERRIF">
         <value caption="Vbus has dropped below the Vbus valid threshold during a session" name="" value="0x1" />
         <value caption="No interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Suspend Interrupt Enable bit" name="USBCSR2__SUSPIE">
         <value caption="Suspend signaling interrupt is enabled" name="" value="0x1" />
         <value caption="Suspend signaling interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Resume Interrupt Enable bit" name="USBCSR2__RESUMEIE">
         <value caption="Resume signaling interrupt is enabled" name="" value="0x1" />
         <value caption="Resume signaling interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Reset/Babble Interrupt Enable bit" name="USBCSR2__RESETIE">
         <value caption="Interrupt when reset (" name="" value="0x1" />
         <value caption="Reset/Babble interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Start of Frame Interrupt Enable bit" name="USBCSR2__SOFIE">
         <value caption="Start of Frame event interrupt is enabled" name="" value="0x1" />
         <value caption="Start of Frame event interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Device Connection Interrupt Enable bit" name="USBCSR2__CONNIE">
         <value caption="Device connection interrupt is enabled" name="" value="0x1" />
         <value caption="Device connection interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Device Disconnect Interrupt Enable bit" name="USBCSR2__DISCONIE">
         <value caption="Device disconnect interrupt is enabled" name="" value="0x1" />
         <value caption="Device disconnect interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Session Request Interrupt Enable bit" name="USBCSR2__SESSRQIE">
         <value caption="Session request interrupt is enabled" name="" value="0x1" />
         <value caption="Session request interrupt is disabled" name="" value="0x0" />
      </value-group>
